src/Ssl_CI/Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SslCI_АдресВРепозитории</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>450</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_ИДКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_АвторКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_ДатаКоммита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_СообщениеКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_ИмяВетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SslCI_НеОбновлятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыСписка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыОбъекта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Ssl_CI/Catalogs/ДополнительныеОтчетыИОбработки/Forms/SslCI_ИсторияКоммитов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Файл = Параметры.Файл;
	
	РеквизитыФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Файл, 
		"SslCI_АдресВРепозитории, SslCI_ИДКоммита, SslCI_ИмяВетки, SslCI_АвторКоммита, SslCI_ДатаКоммита, SslCI_СообщениеКоммита");
	
	ИмяФайла 	= РеквизитыФайла.SslCI_АдресВРепозитории;
	Ветка 		= РеквизитыФайла.SslCI_ИмяВетки;
	ТекКоммит	= РеквизитыФайла.SslCI_ИДКоммита;
	
	АвторКоммита 	 = РеквизитыФайла.SslCI_АвторКоммита;
	ДатаКоммита 	 = РеквизитыФайла.SslCI_ДатаКоммита;
	СообщениеКоммита = РеквизитыФайла.SslCI_СообщениеКоммита;
	
	Если ИмяФайла = ""
		Или Ветка = "" Тогда
		ТекстСообщения = НСтр("ru='Файл не привязан к репозиторию'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДанныеФайла = SslCI_РаботаСГитом.ИсторияКоммитов(ИмяФайла, Ветка);
	
	Если ДанныеФайла.Успех Тогда
		
		ЕстьТекущий = Ложь;
		Для Каждого Коммит Из ДанныеФайла.Коммиты Цикл
			НовыйКоммит = Коммиты.Добавить();
			НовыйКоммит.ИдКоммита 			= Коммит.id;
			НовыйКоммит.АвторКоммита 		= Коммит.committer_name + " <" + Коммит.committer_email + ">";
			НовыйКоммит.ДатаКоммита 		= Коммит.committed_date;
			НовыйКоммит.СообщениеКоммита 	= Коммит.message;
			
			НовыйКоммит.ЗадачаВТаскТрекере	= "см.задачу";
			НовыйКоммит.Коммит = "см.коммит";
			НовыйКоммит.ПерейтиНаКоммит = "откатить до коммита";
			
			Если Коммит.id = ТекКоммит Тогда
				ЕстьТекущий = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьТекущий Тогда
			НовыйКоммит = Коммиты.Добавить();
			НовыйКоммит.ИдКоммита 		 = ТекКоммит;
			НовыйКоммит.АвторКоммита 	 = АвторКоммита;
			НовыйКоммит.ДатаКоммита 	 = ДатаКоммита;
			НовыйКоммит.СообщениеКоммита = СообщениеКоммита;
			
			НовыйКоммит.ЗадачаВТаскТрекере	= "см.задачу";
			НовыйКоммит.Коммит = "см.коммит";
			НовыйКоммит.ПерейтиНаКоммит = "откатить до коммита";
		КонецЕсли;
		
		Коммиты.Сортировать("ДатаКоммита");
	Иначе
		ТекстСообщения = НСтр("ru='Не найдена информация о коммитах'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКоммиты

&НаКлиенте
Процедура КоммитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Коммиты.ТекущиеДанные;
	
	Если Поле = Элементы.КоммитыЗадачаВТаскТрекере Тогда
		SslCI_РаботаСГитом.ОткрытьЗадачуВТрекере(ТекДанные.СообщениеКоммита);
	КонецЕсли;
	
	Если Поле = Элементы.КоммитыКоммит Тогда
		SslCI_РаботаСГитом.ОткрытьКоммит(ТекДанные.ИдКоммита);	
	КонецЕсли;
	
	Если Поле = Элементы.КоммитыПерейтиНаКоммит Тогда
		ПерейтиНаКоммит(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиНаКоммит(Команда)
	
	ТекДанные = Элементы.Коммиты.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		SslCI_РаботаСГитом.ПерейтиНаКоммит(Файл, ИмяФайла, ТекДанные.ИдКоммита);
		ТекКоммит = ТекДанные.ИдКоммита;
		
		Если ВладелецФормы.ИмяФормы = "Справочник.ДополнительныеОтчетыИОбработки.Форма.ФормаЭлемента" Тогда
			ВладелецФормы.ПеречитатьДанныеФормы();	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
